The invalidPenNumber for clearing line wieght overrides.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2014
 Syntax
  C#
public static int InvalidPenNumber { get; }
  Visual Basic
Public Shared ReadOnly Property InvalidPenNumber As Integer
	Get
  Visual C++
public:
static property int InvalidPenNumber {
	int get ();
}
 See Also
  OverrideGraphicSettings Class
  Autodesk.Revit.DB Namespace